; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	image3 - mode
	image5 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation1 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph4)
	(supports instrument0 image5)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(pointing satellite0 Star16)
	(have_image Phenomenon9 image1)
	(have_image Planet10 image3)
	(have_image Star11 image1)
	(have_image Planet12 image3)
	(have_image Phenomenon13 image5)
	(have_image Phenomenon13 spectrograph2)
	(have_image Planet14 spectrograph4)
	(have_image Planet15 image1)
	(have_image Planet15 image3)
	(have_image Star16 spectrograph2)
	(have_image Star16 image5)
))

)

; plan
1. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   goals met: 0 of 12
5. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 1 of 12
6. (turn_to satellite0 planet15 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet15)
   goals met: 1 of 12
7. (take_image satellite0 planet15 instrument1 image3)
   added: (have_image planet15 image3)
   goals met: 2 of 12
8. (take_image satellite0 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 3 of 12
9. (turn_to satellite0 planet12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet12)
   goals met: 3 of 12
10. (take_image satellite0 planet12 instrument1 image3)
   added: (have_image planet12 image3)
   goals met: 4 of 12
11. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 4 of 12
12. (take_image satellite0 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   goals met: 5 of 12
13. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 12
14. (take_image satellite0 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 6 of 12
15. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 12
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 12
17. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 12
18. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 6 of 12
19. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 6 of 12
20. (take_image satellite0 phenomenon13 instrument0 image5)
   added: (have_image phenomenon13 image5)
   goals met: 7 of 12
21. (take_image satellite0 phenomenon13 instrument0 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 8 of 12
22. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 8 of 12
23. (take_image satellite0 planet14 instrument0 spectrograph4)
   added: (have_image planet14 spectrograph4)
   goals met: 9 of 12
24. (turn_to satellite0 star16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star16)
   goals met: 10 of 12
25. (take_image satellite0 star16 instrument0 image5)
   added: (have_image star16 image5)
   goals met: 11 of 12
26. (take_image satellite0 star16 instrument0 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 12 of 12
